{

  "init": "lintunen_erik.init()",

  "cv": "./media/files/vibing.png",

  "socials": [
    {
      "GitHub": "https://github.com/pixel-tree"
    },
    {
      "LinkedIn": "https://www.linkedin.com/in/erik-lintunen/"
    },
    {
      "Medium": "https://medium.com/@erik.lintunen"
    }
  ],

  "footer": "© 2021 pixel-tree",

  "about": [
    "Good dawning to thee, friend. I'm an artist and creative technologist (and secretly an aspiring mathematician) whose work is grounded in philosophy, new media research and information experience design. I like to learn new things -- particularly, I'm fascinated with the theory of knowledge, interpretability of statistical models, and social complexity. This site is a scrapbook of sorts, where I attempt to capture fragments of my (somewhat restless) mind in flux.",
    "I've developed and exhibited a range of collaborative works across spaces, places and frequencies: Barbican Open Lab, HOME Manchester, IKLECTIK, RA Lates, Resonance FM/Extra, Royal College of Art, Somerset House, SPILL Festival of Performance, University of the Arts London, WIRED Japan Creative Hack Awards, fringe venues, and online. I mainly practice creative coding; but dabble in theatre, sound and radio, and occasionally perform. Below are some samples of my work, and in my blog expect to find a range of short fiction, memes, <i>super cereal</i> junk as well as other existential musings. Please use the contact page, should you wish to leave a message. Here be internet dragons."
  ],

  "aboutQ": [
    "\"And standing before this symbolic night bursting with stars, I opened myself for the first time to the tender indifference of the world.\" - Meursault (Camus, 1942)"
  ],

  "portfolio": [
    {
      "year": "2020",
      "id": "Cloudy Logic",
      "body": [
        "{1}",
        "[1] is a piece of philosophical writing and an online artwork, made up of several narratives that broadly contemplate the nature of knowledge in the age of AI.",
        "{2}",
        "It is inspired by an [2] of the same name, in which parallels are made between machine learning systems and astrological forecasting -- that is, pseudo-rationality, where superstitions are presented in empirical terms to make them appear more credible.",
        "{3}",
        "Developed as part of my MA studies and exhibited online (2020-2021). Featured in two RCA2020 collections: [3] and [4]."
      ],
      "media": [
        {
          "Cloudy Logic": "./media/files/cl.png"
        },
        {
          "Representations": "./media/files/representations.png"
        },
        {
          "Pythia": "./media/files/pythia.gif"
        }
      ],
      "links": [
        {
          "Cloudy Logic": "https://cloudylogic.space/"
        },
        {
          "article": "https://thenewinquiry.com/cloudy-logic/"
        },
        {
          "Humanistic Technologists Design for the Now": "https://2020.rca.ac.uk/collections/humanistic-technologists-design-for-the-now"
        },
        {
          "Data and AI": "https://2020.rca.ac.uk/collections/data-and-ai"
        }
      ]
    },
    {
      "year": "2019",
      "id": "Neuroimagined Dreamscapes #1",
      "body": [
        "{1}",
        "The installation is inspired by J. G. Ballard's <i>The Thousand Dreams of Stellavista</i>, a short story portraying a future in which houses take on the emotional presence of their previous inhabitants.",
        "{2}",
        "A wearable helmet captures the theta rhythm -- a neural oscillatory pattern associated with dreaming. These data were used to manipulate and personalise images generated by a GAN trained on landscape imagery. Exhibited as part of [1], Ugly Duck, London."
      ],
      "media": [
        {
          "Ugly Duck Exhibition": "./media/files/neuroimagining.png"
        },
        {
          "Dreamscape": "./media/files/dreamscape.png"
        }
      ],
      "links": [
        {
          "Anamorphic Waves": "http://uglyduck.org.uk/portfolio_page/anamorphic/"
        }
      ]
    },
    {
      "year": "2018",
      "id": "Fanfare for Satoshi Nakamoto [鉱山]",
      "body": [
        "{1}",
        "A generative audio installation based on a real-time sonification of the Bitcoin blockchain. Devised to raise awareness of the network's energy footprint -- at the time, according to some estimates, its electricity consumption was on par with a mid-sized European country. In large part, this is due to the consensus algorithm, proof-of-work, where transactions are verified by solving computational puzzles. The sonic environment of <i>the mine</i> emerges from data scraped through developer APIs: relevant variables (difficulty, block size, etc.) are used to manipulate sound and hence transform the operational aspects of the network into a sensory experience.",
        "Exhibited as part of the LCC Degree Show, London. [1]."
      ],
      "media": [
        {
          "LCC Degree Show 2018": "./media/files/fanfare.png"
        }
      ],
      "links": [
        {
          "WIRED Japan Creative Hack Award finalist 2018": "https://hack2018.wired.jp/en/finalist/"
        }
      ]
    },
    {
      "year": "2018",
      "id": "Meditating I/Os",
      "body": [
        "{1}",
        "This project materialised as a dramatic reading of fiction and documentary material, performed live on stage and broadcast on radio.",
        "{2}",
        "Meursault -- the protagonist of <i>The Outsider</i> (Albert Camus, 1942) -- is lost in time and space. He moves through dreamy, binaural soundscapes, and gradually reconstructs his story.",
        "{3}",
        "Staged utilising an experimental technical set-up, the work explores human-object entanglements in our post-digital world.",
        "<div style='padding:56.25% 0 0 0;position:relative;'><iframe src='https://player.vimeo.com/video/246015457' class='media' style='position:absolute;top:0;left:0;width:100%;height:100%;' frameborder='0' allow='autoplay; fullscreen'></iframe></div><script src='https://player.vimeo.com/api/player.js'></script>",
        "Performed at [1], London. Broadcast on [2]/[3], worldwide. Commissioned as part of [4], kindly supported by [5]."
      ],
      "media": [
        {
          "Meditating I/Os Rehearsal": "./media/files/mios.png"
        },
        {
          "Meditating I/Os 360": "./media/files/mios360.png"
        },
        {
          "Meditating I/Os at IKLECTIK": "./media/files/iklectik.png"
        }
      ],
      "links": [
        {
          "IKLECTIK Art Lab": "https://iklectikartlab.com"
        },
        {
          "Resonance FM": "https://www.resonancefm.com"
        },
        {
          "Extra": "https://extra.resonance.fm"
        },
        {
          "Strands": "https://jerwoodarts.org/projects/resonance-fm/"
        },
        {
          "Jerwood Charitable Foundation": "https://jerwood.org/jerwood-foundation"
        }
      ]
    },
    {
      "year": "2015-2021",
      "id": "Experiments",
      "body": [
        "{18}",
        "NLP learning. Here, written documents are tokenised by n-grams; processed using TF*IDF, PCA and t-SNE. Visualised using D3.js. [13].",
        "{17}",
        "Bacteria RNG. Created as part of [12]'s <i>Bacteria as a Digital Mediator</i>. TL;DR: images from a live feed of cultivated bacteria are hashed and used to seed a pseudo-random number generator.",
        "{16}",
        "Latent Space Interpolations. Investigating visual representations of migration online using GANs.",
        "<div style='padding:56.25% 0 0 0;position:relative;'><iframe src='https://player.vimeo.com/video/485687760?transparent=0' class='media' style='position:absolute;top:0;left:0;width:100%;height:100%;' frameborder='0' allow='autoplay; fullscreen'></iframe></div><script src='https://player.vimeo.com/api/player.js'></script>",
        "Gymnopaedia Exercise Number 1. Developed for an exhibition of works by [11]. Browser application: AI trained on MIDI data extracted from religious folksong (call-and-response interaction).",
        "{15}",
        "R scripts to consolidate learning in maths and stats (e.g., p.d.f. by integration, standardise normal random variables, compute probabilities, Euclid's algorithm, etc.).",
        "{14}",
        "Data physicalisation. In this example, EEG data are translated into hues of light.",
        "{13}",
        "{12}",
        "{11}",
        "Sound experiments (interactive systems for theatre and live-art; experimentation with various media). Included below a small selection of images to represent these projects.",
        "{10}",
        "Barbican Open Lab. Space and mentorship for experimentation with no expectation of a finalised piece of work. In collaboration with [9] and [10].",
        "{9}",
        "{8}",
        "<iframe width='100%' height='166' class='media' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/386716187%3Fsecret_token%3Ds-Eo6uN&color=%232d352c&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>",
        "<iframe width='100%' height='166' class='media' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/401148816%3Fsecret_token%3Ds-RNbzT&color=%232d352c&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>",
        "<iframe width='100%' height='166' class='media' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/437813991%3Fsecret_token%3Ds-9X4RG&color=%232d352c&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>",
        "Bedtime Monologues. Semi-improvised radio performances in collaboration with [6], [7] and [8].",
        "{7}",
        "{6}",
        "Pixel Tears. Theatre performance in which physical space was divided into smaller virtual sections using headphone playback. Written and performed by [5].",
        "{5}",
        "Another Bald Dead Woman. Performed at SPILL Festival. The stage was transformed into an instrument using sensors -- used to sequence and manipulate sounds through performer movement. Written by [4].",
        "{4}",
        "{3}",
        "Remote broadcasting. As part of these projects, a temporary radio station is constructed somewhere (typically, in a public space). I have experience working on numerous large-scale projects, including at [1], [2], [3], and others.",
        "{2}",
        "Workshops and teaching. I've hosted workshops for my student peers; formally taught interaction design; developed and led community workshops.",
        "{1}",
        "Not forgetting where a number of these ideas have been conceived..."
      ],
      "media": [
        {
          "Lake District UK": "./media/files/lakes.png"
        },
        {
          "LCC Workshop": "./media/files/workshop.png"
        },
        {
          "Gasworks London": "./media/files/gasworks.png"
        },
        {
          "Tate Modern": "./media/files/tate.png"
        },
        {
          "SPILL Festival": "./media/files/spill.png"
        },
        {
          "Ugly Duck Garage": "./media/files/garage.png"
        },
        {
          "Pixel Tears at CSM": "./media/files/pixeltears.png"
        },
        {
          "Resonance": "./media/files/radio.png"
        },
        {
          "Bedtime Monologues": "./media/files/bm.gif"
        },
        {
          "Open Lab": "./media/files/openlab.png"
        },
        {
          "Ableton Surround": "./media/files/ableton.png"
        },
        {
          "Barbican Pit Theatre": "./media/files/barbican.png"
        },
        {
          "No Longer A Secret": "./media/files/secret.png"
        },
        {
          "EEG Physicalisation": "./media/files/eeg.png"
        },
        {
          "R PDF Probabilities": "./media/files/probability.gif"
        },
        {
          "Latent Space Interpolations": "./media/files/migra.png"
        },
        {
          "Bacteria RNG": "./media/files/bacteriaRNG.gif"
        },
        {
          "Visulisation of OII Research": "./media/files/OII.gif"
        }
      ],
      "links": [
        {
          "Gasworks": "https://www.gasworks.org.uk/2018/04/25/Who_cares_A_radio_tale_Press_Release__AA6Dkgi.pdf"
        },
        {
          "South London Gallery": "https://www.southlondongallery.org/projects/bank-holiday-broadcast/"
        },
        {
          "Tate Modern": "https://www.tate.org.uk/whats-on/tate-modern/festival/art-on-air"
        },
        {
          "Louis King": "https://www.spillfestival.com/show/another-bald-dead-woman/"
        },
        {
          "Grace Lambert": "https://www.instagram.com/grace.lamberrt/"
        },
        {
          "Artur Strekalov": "https://soundcloud.com/mutate3k"
        },
        {
          "Lucas Boetsch": "https://soundcloud.com/ka_louxm"
        },
        {
          "Lucie Stepankova": "https://www.introspectiveelectronics.org"
        },
        {
          "Anna Nykyri": "https://annanykyri.com"
        },
        {
          "Louiseanne Wong": "https://www.instagram.com/louiseannewong/"
        },
        {
          "Sarah Derat": "https://sarahderat.com"
        },
        {
          "Akvile Terminaite": "https://2020.rca.ac.uk/students/akvile-terminaite"
        },
        {
          "Live demo": "http://34.121.78.114/"
        }
      ]
    }
  ],

  "blogQ": [
    "\"[My work is] all pretty meaningless. I find a good restaurant. I write it up for a magazine. Go here, try this. Why bother? Why shouldn't people just go where they feel like and order what they want? Why do they need someone to tell them? What's a menu for? And then, after I write the place up, the place gets famous and the cooking and service go to hell. It always happens. Supply and demand get all screwed up. And it was me who screwed it up. I do it one by one, nice and neat. I find what's pure and clean and see that it gets all mucked up. But that's what people call information.\" - Unnamed protagonist (Murakami, 1988)"
  ],

  "blog": [
    {
      "date": "240621",
      "title": "GAN Theft Auto",
      "body": [
        "[1]",
        "Following up on my previous post about representations, this is pretty cool! In short, the authors train a neural network to predict new images based on previous frames and player (controller) input. It seems that the model is able to replicate physical phenomena (interactions between objects in the scene -- e.g., mountains getting closer, caustics, collisions). I feel like the result itself is somewhat expected (i.e., learning features of the physics engine), but what I find really interesting is that the <i>illusion</i> of being inside a 3D game environment is eerily realistic."
      ],
      "links": [
        {
          "Playing a Neural Network's version of GTA V: GAN Theft Auto": "https://youtu.be/udPY5rQVoW0"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "030621",
      "title": "Cartesian Doubt #1",
      "body": [
        "<i>Representations are weird and they’re everywhere.</i>",
        "Hi there. This is a new series that I’ve been working on, where I’ll publish short bits about various philosophical topics. My perspective is interdisciplinary and style informal. The first post is about representations -- a key topic that connects many of my intellectual compulsions (and as such, it’s a bit of a brain dump).",
        "1. INFORMATION, EXPERIENCE, AND ALL THAT JAZZ",
        "<q>\"When you finish a PhD in mathematics, they take you to a special room and explain that \\(i\\) isn’t the only imaginary number—turns out that ALL the numbers are imaginary, even the ones that are real.\" - [1] (2020)</q>",
        "I’ve been watching [2] given by Joel Hamkins on the philosophy of mathematics. He quotes Owens in the first part, and I thought it would be the perfect way to kick things off. My artist friend [3] named her recent play in the same vein: <i>Is it really ever really really really real?</i> It’s a good question, albeit somewhat humbling. In other words, what is real if reality is merely a representation? Let’s unpack this a little.",
        "Theories about the fundamental nature of reality are metaphysical; that is, they cannot be empirically tested. The discourse often feels circular and frustrating to engage in. Ultimately, when it comes to the hard questions, we are left with <i>intuitions</i> (i.e., rational insight) in the place of solid knowledge. Then, how are metaphysical propositions validated? (This is not a question that I’m going to address, but rather something I’m genuinely curious about.)",
        "<q>\"My room has sound behind its walls, under its floorboards and on top of its ceiling. They make it shrink and expand, move and be still. What is in the room is visible, present, objectively here. The sound is invisible, not here, but present all the same. It is generated in my subjective hearing of it: Rushing into the objective and changing what I see. The walls are less stable in sound, wobbly even, permeable, letting things in and out; testing notions of intimacy, neighbourliness and safety. The visual room is the set on which sound plays invisible narratives: some sinister, some cheerful, some unnoticed. Unseen protagonists who might really be there or just invented by me play out fantastic scenarios that might be real, involving aliens, spaceships, cats, dogs and microwaves. -- Anything can happen.\" - [4] (2011)</q>",
        "AFAIK the author is referring to the philosophical idea of Possible Worlds, where reality is conceived as the sum of the imaginable rather than simply what exists physically. Regardless of how one feels about this, there is a self-evident point here: our realities are significantly augmented by human variability (biological, environmental). Personal experiences matter. Zooming out, it’s weird to think that we’ve evolved in such a way that allows us to simulate reality in phenomenal terms -- by which I mean that we’re self-aware and able to articulate our thought processes through shared language; (mostly) distinguish between what we know and don't know and take action to fill any knowledge gaps; and just generally reason based on complex abstractions of the world. Despite this awesomeness, there still exist vague concepts that elude proper formalisation: intelligence, consciousness, creativity, and so on. (But there is something deeply moving about not knowing -- or rather, in that there might exist a hard limit beyond which things are unknowable.)",
        "Perhaps somewhat surprisingly, some of these mysteries are being addressed through AI research. After all, on a macro-level the field is trying to solve intelligence, and the biggest challenges there directly stem from not knowing how to represent general intelligence mathematically. [5], echoing the words of her former mentor, [6], writes about the strange loop of consciousness: it is not so much our ability to construct mental models that makes us unique but rather our ability to simulate models of our mental models (that is, metacognition of some kind). Whether AI systems <i>learn</i> anything in the first place is questionable (and IMO simply depends on one’s level of abstraction); but the state-of-the-art in the field employ technologies inspired by different forms of real-world learning and bits borrowed from human cognition.",
        "These advances have seen plenty of success (hierarchical feature learning, convolutions in vision models, attention and memory for sequential data, reinforcement learning, etc.). Personally, in ML research I’m most excited by [7] and co., where work is published in an attempt to demystify how neural networks self-organise, by visualising the emergent information processes. This subfield of ML is still in its infancy; but the work resembles trying to reverse-engineer computer programs, and interestingly this ethos resonates with the words of [8], re: how statistics came to be -- Can I turn the problem around? Can I infer the underlying mechanisms from the outcomes?",
        "I’m digressing slightly, but the point I’m trying to make is that representations are everywhere, and they have played a big part in philosophical discourse across time. I often associate representations with knowledge (because the human experience is so intrinsically tied to learning), and this leads us into the field of epistemology. That is, the formal study of knowledge -- with a focus on the tools and processes by which we make sense of the world. And this is partly what attracted me to studying maths. After all, it is arguably the foundation of all human thought.",
        "It seems that the philosophical zeitgeist is aligned with my previous sentiment; historically, reflecting developments in information communication technologies (ICTs). The philosophical landscape has shifted from a focus on the nature of reality to our knowledge of reality (and more recently to language and to information, i.e., the technological frameworks within which we make sense of our knowledge of reality). In this sense, I understand why [9] suggests that philosophy has always had information at its heart.",
        "There exist fascinating tensions within epistemology between rationalists and empiricists. Superficially, one might characterise this confrontation as a difference in how two concepts are understood: <i>information</i> and <i>experience</i>. Specifically, the extent to which the latter plays a part in shaping the former. Immanuel Kant developed an epistemological framework formalising this, by drawing a distinction between <i>a priori</i> and <i>a posteriori</i> (knowledge independent of experience and knowledge informed by empirical evidence, respectively). For instance, we learn about certain things from a young age: we fall and hurt ourselves; we might be rewarded for good behaviour; and we age irreversibly. We learn that everything is just happening -- we are part of the universe and there is no place for us to stand outside of its causal structure. Conversely, tautologies are redundant statements where we repeat ourselves, and exemplify how knowledge can be derived and justified through reason alone: heroic heroes, always and forever, a beginner who has just started. While I find it hard to comprehend how knowledge can be completely independent of experience, I’m guessing the nature of <i>a priori</i> lies in generalisation and abstraction.",
        "I find both schools of thought useful. On the one hand, I find it immensely useful to think about the world in terms of abstract objects, sets and their interrelations; but also find value in experimental and systematic reflections of the properties and structures of experience. Unfortunately, I’m too uninformed in the subject matter to discuss it any further, and it’s time to move on. I’ve briefly contextualised how representations relate to knowledge; but what does it mean to represent something in practice? And how do representations relate to my interests? I have more questions than answers, and this overwhelming curiosity takes me back to a Finnish lullaby that, crudely translated, goes something along the lines of...",
        "<q><i>There are many wonderful things in the world,<br>It amazes, puzzles the little wayfarer.</i></q>",
        "2. MATHEMATICAL REPRESENTATIONS, FORMS, AND PROBABILITY",
        "{1}",
        "Source: Blizzard Entertainment Inc.",
        "<q>\"Perhaps it is your imperfections... that which grants you free will... that allows you to persevere against all cosmically calculated odds. You prevail where the Titan’s own perfect creations have failed.\" - [10] (pictured above)</q>",
        "You might have heard of Plato’s theory of Forms. It comes up in one of his most well-known stories: <i>The Allegory of the Cave</i>. I’m not super familiar with the narrative, so I won’t butcher it here; but in essence, Forms are the purest of all things -- they transcend time and space and exist beyond our phenomenal world. According to the theory, objects are then merely momentary instances of these Forms; that is, they represent Ideas. To illustrate this in practice, consider circles. Digital circles are made up of pixels, and physical circles are made up of atoms and molecules. There are no perfect circles. Regardless, we all know what is meant by a circle. We can also define a circle mathematically, in standard form",
        "\\[(x-a)^2 + (y-b)^2 = r^2, \\quad \\text{with centre} \\quad (a, b) \\quad \\text{and radius} \\quad r.\\]",
        "Here, we have a representation of a circle -- an implicit equation, that defines the object geometrically in \\(\\mathbb{R}^2\\) given any real \\(a, b\\) and non-negative \\(r\\). But a <i>perfect</i> circle cannot be computed, as it is continuous (which implies uncountability, in turn implying uncomputability). The circle can only be approximated using a set of discrete values. Good enough, right? Sure, but I think it’s an interesting fact of nature that mathematical objects possess some Ideal features, in that their accurate reproduction is physically impossible.",
        "Let’s consider another example, this time from statistics. One could say that the statistical doctrine is very different to that of mathematics: the latter is the study of certainty (proofs, sets, axioms, etc.), whereas the former is the study of uncertainty (probability, hypothesis testing, confidence intervals, etc.). Statistical analysis is typically characterised as inferring things about a population based on sample data (NB here <i>population</i> does not refer to the colloquial use of the word, but instead to any subject of statistical observation -- this includes non-human things). We know that real-world phenomena can be modelled by particular probability distributions (which generally belong to wider families of distributions). For instance, the expected outcome of a single roll of an unbiased die can be represented using the discrete uniform distribution, where the probability of obtaining any one number is \\(\\frac 1 6 \\). Here, the possible outcomes are counts, but many of the real-world variables that we are interested in modelling are measured (hence, they are continuous as opposed to discrete).",
        "Take for instance the normal distribution, a.k.a. the Gaussian, a.k.a. the bell curve, that is widely known (and widely used due to its nice symmetric properties). Let \\(X\\) be a normally distributed random variable with mean \\(\\mu = 0\\) and variance \\(\\sigma^2 = 1\\). That is, \\(X \\sim N(0, 1)\\). This is the standard normal distribution. We represent the probabilities by using a continuous function; namely, a probability density function (p.d.f.). This is graphed below.",
        "{2}",
        "Source: unknown.",
        "As you will be able to see, the distribution is unimodal (i.e., has one peak) and is symmetric about the mean. Almost all of the distribution is contained within \\(\\pm 3\\) standard deviations from the mean. The formula on the right is extremely useful -- it is used to standardise a random observation \\(X\\) which, for instance, empowers us to use parametric tests on a wide variety of data with a large enough sample size.",
        "I’ll illustrate my point about Forms by drawing some random samples from a (hypothetical) known population. In one of my statistics units at the Open University, we model the waiting times between tsunamis using an exponential distribution with rate parameter \\(\\lambda = \\frac 1 {26}\\). For now, assume that this model is reasonable. I draw 1000 random samples, each of size \\(n = 30\\), from this distribution; and represent these as a \\(30 \\times 1000\\) matrix, where each column represents an independent sample of 30 waiting times.",
        "<code>times <- matrix(nrow=30, ncol=1000)<br>for (i in seq(1, 1000)) {<br><span class='indent'></span>times[,i] <- rexp(30, 1/26)<br>}</code>",
        "The distributions of the first eight samples are included below as relative-frequency histograms. In each of these, the overlaid curve represents our model, \\(M(\\frac 1 {26})\\). Note that this curve looks different in each graph only due to the scaling of the axes, when in fact it is the same curve.",
        "{3}",
        "It is evident that some samples follow an exponential model, but as \\(n\\) is small there is quite a bit of variability. What is clear though, is that the data are right-skew with the peak to the left of the graph (which is no surprise here as the samples come from a known population). Based on these data, we could infer that, according to the model, it seems fairly probable that the time interval between two consecutive tsunamis is under five years.",
        "Enter a beautiful Idea in probability theory: the Central Limit Theorem. Let’s create some new samples by sampling the mean of each of our 1000 exponential samples. By the Central Limit Theorem, if \\(n > 25\\), then regardless of the underlying population the sampling distribution of the mean is approximately normal (which explains the previously made point about the convenience of standardisation).",
        "<code>means <- vector()<br>for (i in seq(1, 1000)) {<br><span class='indent'>means[i] <- mean(times[,i])</span><br>}</code>",
        "Six graphs are included here -- representing three independent samples (where \\(n = 25, \\quad n = 100, \\quad n = 1000\\)). The histograms have Gaussian curves overlaid, and below each of these are their respective probability plots (used to assess normality -- the data should lie roughly along a straight line with no systematic patterns). As we can see, when increasing sample size the sampling distribution of the mean tends to the normal distribution. And furthermore, it <i>settles down</i> as \\(n\\) becomes arbitrarily large.",
        "{4}",
        "We may elaborate on this interesting statistical phenomenon of settling down by creating an artificial dataset. This time, drawing three samples from the standard normal distribution, where \\(n = 500, \\quad n = 1500, \\quad n = 100000.\\) The samples are visualised below.",
        "<code>small <- rnorm(500, 0, 1)<br>med <- rnorm(1500, 0, 1)<br>large <- rnorm(100000, 0, 1)</code>",
        "{5}",
        "It doesn’t matter whether the data are artificial or not -- when we increase \\(n\\), the observed values (divided into the bins of the histogram) tend to the probability model (the curve). In other words, the sample becomes a more accurate representation of the underlying population. This is trivial and expected; however, the population is rarely known (or it might be prohibitively expensive/otherwise impractical to include in its entirety). Hence, in practice this statistical fact is useful.",
        "To highlight the difference between continuous and discrete sets (between the Ideal form and its representation, if you’d like), consider their differences in terms of probabilities. Perhaps counterintuitively, under a continuous model the probability of obtaining a single value (e.g., exactly 12 months between two tsunamis) is zero. This is because time is measured rather than counted -- accuracy can be arbitrarily increased, hence, there are an infinite number of possible values that the waiting time can take. In the continuous case, the probability of observing a certain value is calculated using intervals; e.g., 12 months can be defined as any value in \\([11.5, 12.5)\\). Its probability, \\(P(11.5 \\leq X < 12.5)\\), is then calculated using integration -- a valid p.d.f. integrates to 1 over its range, meaning that the area under the curve represents probabilities. (Also, we can estimate the occurrence of events in continuous time using something called the Poisson process.) But as with the circle, we are unable to physically observe the Ideal object.",
        "The implication here is that, in a sense, there exist abstract objects that we use to reason about the real world, which materialise as lower resolution approximations of their Form. To a computer scientist this might be a trivial fact, as computers deal exclusively with discrete data (for instance, some functions are approximated using Taylor Polynomials).",
        "Returning to the words of Algalon, spoken in the Celestial Planetarium of Ulduar: \"Perhaps it is your imperfections... that which grants you free will... that allows you to persevere against all cosmically calculated odds.\" This lingers in my mind nicely. Assuming that the universe is finite and isolated, there will be some underlying distribution from which the music is played, so to speak. Maybe it’s predetermined, maybe not (who cares?). But ultimately, all life kneels before entropy -- the arrow of time. Or perhaps, as proposed by Penrose, we iterate through infinite cosmic cycles. Either way, there’s only a single direction for us to move in (at the very highest levels of abstraction).",
        "{6}",
        "Source: unknown.",
        "3. CANTOR'S INTERLUDE",
        "Before moving on into the realm of discrete mathematics, let me elaborate on something previously mentioned: uncountability. It’s useful here to briefly expand on numbers, sets, the continuum and infinity.",
        "What are numbers? I mean, we deal with them regularly in life; but what are they really (/what do they represent)? Simply put, they can be thought of as <i>classification invariants of the equinumerosity relation</i>. (OK, maybe not so simply put.) In other words, numbers are somewhat arbitrary representations, used to classify objects or sets based on one primary feature -- equinumerosity (this set has the same number of elements as the other set). For instance, the integer 42 can be represented in various ways: \\(\\frac {126} 3\\) (rational) = XLII (Roman numerals) = 101010 (binary). Here, seemingly unrelated objects (following different numeral systems) refer to the same Idea; that is, the number 42.",
        "Consider some common sets of numbers...",
        "\\[\\mathbb{N} \\subseteq \\mathbb{Z} \\subseteq \\mathbb{Q} \\subseteq \\mathbb{R} \\subseteq \\mathbb{C}\\]",
        "From left to right: each set is a subset of the set that follows. The natural numbers, \\(\\mathbb{N}\\), consist of non-negative whole numbers (\\(0, 1, 2, \\dots\\)). The integers, \\(\\mathbb{Z}\\), include the naturals as well as the set of negative whole numbers (\\(\\dots, -2, -1, 0, 1, 2, \\dots\\)). The rational numbers, \\(\\mathbb{Q}\\), are numbers that can be represented using fractions, in the form \\(\\frac{p}{q}\\) where \\(p\\) and \\(q\\) are integers. The real numbers, \\(\\mathbb{R}\\), contain all of the aforementioned sets as well as those numbers which can't be represented by fractions -- i.e., they have non-repeating, infinite decimal expansions (e.g., \\(\\sqrt{2}, \\pi, \\text{e}\\)). The complex numbers, \\(\\mathbb{C}\\), are numbers expressed in the form \\(a + bi\\) where \\(a\\) and \\(b\\) are real numbers and the term in \\(i\\) is its imaginary component (where the imaginary unit \\(i\\) satisfies \\(i^2 = -1\\)). To visualise these sets, one can simply picture all but the complex numbers using the number line; and for the complex numbers, one can use the complex plane, where the horizontal axis represents its real component, and the vertical axis represents its imaginary component.",
        "{7}",
        "Source: MathsIsFun.",
        "The sets \\(\\mathbb{N, Z, Q}\\) share a common feature: they are <i>countably</i> infinite. In mathematical terms, there exists a bijection (one-to-one correspondence) between each of these sets and the natural numbers -- we can pair each element with a unique natural number \\(0, 1, 2, \\dots\\). As for the set of real numbers, enter mathematician Georg Cantor who, in the late 1800s, blew up the world of mathematics with his discoveries.",
        "Real numbers are fascinating in their own right: some of them emerge under somewhat prosaic circumstances, yet have no rational representation. For instance, consider the unit square where all sides are of length 1. Hence, the length of its diagonal (line dividing the square into two triangles) is \\(\\sqrt{2}\\) (by Pythagoras' theorem \\(a^2 + b^2 = c^2\\), so \\(c = \\sqrt{1^2 + 1^2} = \\sqrt{2} = 1.414213\\dots\\)). I will omit proof of its irrationality, as it’s beside the point (and easy to find). But the story of its discovery is interesting. [11] writes:",
        "<q>\"It was a shocking discovery for the Pythagoreans, and indeed heretical in light of their quasi-religious number-mysticism beliefs, which aimed to comprehend all through proportion and ratio, taking numbers as the foundational substance of reality. According to legend, the man who made the discovery of incommensurability was drowned at sea, punished by the gods for revealing the secret knowledge of irrationality.\"</q>",
        "Yikes.",
        "Here are some further examples of irrational numbers. Pi, \\(\\pi = 3.141592\\dots\\), represents the number obtained by dividing the circumference of a circle by its diameter. Then, we have Euler’s number, \\(\\text{e}\\), a mathematical constant that can be defined as \\(\\text{e} = \\lim_{n \\to \\infty} (1 + \\frac 1 n)^n\\) or as the infinite series \\(\\sum_{n = 0}^\\infty \\frac 1 {n!} = 1 + \\frac 1 1 + \\frac 1 {1 \\times 2} + \\frac 1 {1 \\times 2 \\times 3} + \\dots\\) (where the series converges to \\(\\text{e} = 2.718281\\dots\\) as \\(n\\) tends to infinity).",
        "\"So, what makes the real numbers so special,\" I hear you ask? Well, for a start, Cantor showed that the set of real numbers is <i>uncountably</i> infinite. That is, each of the sets presented here contain an infinite number of elements, but the infinity of the reals is somehow larger than that of some other sets. (We say that the reals have a larger cardinality -- e.g., \\(\\vert \\mathbb{Z} \\vert = \\aleph_0\\) whereas \\(\\vert \\mathbb{R} \\vert = 2^{\\aleph_0}\\), so \\(\\vert \\mathbb{Z} \\vert < \\vert \\mathbb{R} \\vert \\). Interestingly, the cardinality of the <i>power set</i> of the integers is equal to the cardinality of the real numbers: \\(\\vert P(\\mathbb{Z}) \\vert = \\vert \\mathbb{R} \\vert \\). The cardinality of the reals is also known as the cardinality of the <i>continuum</i>, denoted by \\(\\mathfrak{c}\\).) To illustrate the uncountability of \\(\\mathbb{R}\\) consider this proof by contradiction, known as Cantor’s diagonal argument.",
        "<i>Proof.</i> Suppose that the real numbers can be put into one-to-one correspondence with the natural numbers. We enumerate all elements in the set of reals as \\(s_1, s_2, \\dots, s_n\\). Here, we start with square roots of the first nine primes: \\(2, 3, 5, 7, 11, 13, 17, 19, 23\\).",
        "\\begin{alignat}{2} s_1 &= 1.\\mathbf{4}14213562 &&\\dots \\\\ s_2 &= 1.7\\mathbf{3}2050808 &&\\dots \\\\ s_3 &= 2.23\\mathbf{6}067977 &&\\dots \\\\ s_4 &= 2.645\\mathbf{7}51311 &&\\dots \\\\ s_5 &= 3.3166\\mathbf{2}4790 &&\\dots \\\\ s_6 &= 3.60555\\mathbf{1}275 &&\\dots \\\\ s_7 &= 4.123105\\mathbf{6}25 &&\\dots \\\\ s_8 &= 4.3588989\\mathbf{4}3 &&\\dots \\\\ s_9 &= 4.79583152\\mathbf{3} &&\\dots \\\\ \\vdots &\\qquad \\vdots &&\\ddots \\end{alignat}",
        "Then, a new element is constructed from the decimal expansions of the enumerated elements (specifically, from the emphasised diagonal), by choosing any number 0-9 other than that number. Here, we add 1 to each of the bold numbers (and if it happens to be 9 then we cycle back to 0). Hence, the constructed real is",
        "\\[s = 0.\\mathbf{547832754}\\dots.\\]",
        "The list expands indefinitely in the horizontal and vertical directions (the infinite decimal expansion of each number and the infinite number of elements in the set, respectively). It follows that the diagonal is infinite; and our constructed real, \\(s\\), is always different in its \\(n^{th}\\) decimal digit from any enumerated number. It doesn't exist within the list, yet it’s clearly a real number. Therefore, the reals cannot be put into one-to-one correspondence with the natural numbers. Hence, the set is uncountably infinite. \\(\\quad \\blacksquare\\)",
        "(Time has absolutely nothing to do with this, but if the example is not clear enough think of the construction of the new real as a process: enumerating all reals one by one, \\(s\\) is different from every listed number in at least one of the decimal digits, and it will always be different compared to the next by at least one decimal digit.)",
        "Infinity has some other fascinating properties. You might have heard of Hilbert’s <i>paradox of the Grand Hotel</i>. Let’s consider this briefly. Suppose that a hotel has an infinite number of rooms and is full. A new guest arrives. What can we do? To accommodate the new guest, we move each existing guest from room \\(n\\) to room \\(n+1\\). Done! What about an infinite number of new guests? Suppose that they arrive by an infinitely long train. We move each existing guest from room \\(n\\) to room \\(2n\\) (always even) and pair each arriving guest with a unique odd numbered room (e.g., room \\(2n+1\\) where \\(n\\) is their seat number on the train). Again, problem solved! What about a train with an infinite number of cars, each with an infinite number of prospective guests? E-Z! Move existing guests from room \\(n\\) to room \\(2n\\) and allocate each new guest the room \\(3^i 5^j\\) where \\(i\\) represents their car number and \\(j\\) represents their seat number. Every natural number greater than 1 has a unique prime factorisation, and odd times odd is always odd... so again, winning!",
        "If this isn’t weird enough for you, then consider this: ever since Gödel, mathematics has been in existential crisis. His Incompleteness Theorems show that there exist mathematical truths that can never be proved. Without going into the specifics, its implications are apparent: there are things that we believe to be true about the world, but which cannot be known for sure. Turing spiced up the pot with a similar theory regarding computability -- the halting problem. There exists no computer program that, when given an arbitrary program, can determine whether it will run forever or not. In addition to all of this, there appear to be other significant problems in the world of mathematics which remain without clear-cut answers.",
        "{8}",
        "Source: unknown.",
        "I’ve read that Cantor’s ideas were widely despised in his time. It seems, that the Idea of infinity is as sacred to some as rationality was to the Pythagoreans. He was not drowned but died alone in a sanatorium. Personally, I think that there is something poetic about an infinite number of infinities. But then again, I don’t fully understand the implications; and (to my great sadness) good poetry doesn’t work as a justification in mathematics.",
        "I’ll finish this section with the words of [12]: \"I am truly very sorry, but we do not know, fully, what numbers are. The problem of mathematical ontology is not solved.\"",
        "4. DATA REPRESENTATIONS",
        "\"Can you describe what you see here?\"",
        "{9}",
        "Source: [13] elephant.",
        "AI:",
        "\\begin{align} \\text{array([[}&\\text{3.64433594e+01, 0.00000000e+00, 6.73487949e+00,} \\\\ &\\text{0.00000000e+00, 6.36244392e+01, 7.16723480e+01,} \\\\ &\\text{[...]} \\\\ &\\text{2.51059551e+01, 1.39128494e+01, 4.99260292e+01]])} \\end{align}",
        "AI=>Human translation:",
        "{10}",
        "Machine learning algorithms have become ubiquitous in the realm of ICTs. They mediate a significant proportion of our daily interactions, knowledge acquisition, as well as other material aspects of the human experience.",
        "While these technologies offer vast potential in bettering our lives overall, they give rise to complex issues in terms of accountability and inclusion. While it is relatively easy for non-experts to use existing ML technologies, there is an unreasonably high barrier-of-entry to understanding these systems on an informational level. On the one hand, this is somewhat unavoidable as one is required to have a decent grasp of linear algebra, probability theory and calculus, and to possess basic skills in computer programming. But even then, knowing exactly what happens \"under the hood\" remains elusive; and this has given rise to a whole new subfield of AI research, namely, interpretable (or explainable) ML. And this is (IMO) some of the most interesting research currently being done (in the entire world!). So naturally, I’m quite curious about different ways of representing real-world phenomena in the language of computers.",
        "(Though the field is young, some really strong intuitions have already been developed in understanding neural nets -- in [14] the authors handcraft curve detectors which approximate natural ones surprisingly well.)",
        "In the case of the elephant, I’ve fed the image through a convolutional neural network (CNN) trained on the ImageNet dataset, and visualised some of the highly activating channels across the layers. The technical specifics are slightly more complicated; but essentially, the visualisation shows the process of hierarchical feature learning in deep neural networks. The complexity of the patterns increases as we dive deeper into the network -- the early layers recognise edges, corners and simple shapes; and feature filters in deeper layers build on top of the representations learned previously to eventually capture (the essence of) entire objects. The visualisation has been produced using the wonderful [15] library.",
        "In plain neural networks, the way in which this works is that we take digital images and break down the pixels into single vectors (or vectors for each colour channel). This is illustrated below -- can you recognise the object represented here?",
        "{11}",
        "I’m very surprised if your answer was yes. Fortunately, computers are good at this type of thing, and it’s one of the reasons why machine learning has seen so much success -- give a machine some labels which represent classes of objects (cats, dogs, elephants) and accompany those labels with examples (instances of those classes, a.k.a. data) like above, and the machine will learn the necessary features for it to successfully distinguish between the different classes. The Idea is very clever!",
        "To elaborate, consider this pixelated \\(19 \\times 24\\) image of me in the Lake District, UK.",
        "{12}",
        "Each pixel is represented by three numerical values between 0 and 255, for each of the (red, green, blue) colour channels. If we split the channels of the image, we end up with three separate representations.",
        "<code>import matplotlib.pyplot as plt<br>import numpy as np<br>from PIL import Image, ImageOps<br><br>image = np.array(Image.open(\"mosaic.png\"))<br><br>\"\"\"Graph individual colour channels\"\"\"<br><br>red = np.zeros(np.shape(image))<br>green = np.zeros(np.shape(image))<br>blue = np.zeros(np.shape(image))<br><br>red[:, :, 0] = image[:, :, 0]<br>green[:, :, 1] = image[:, :, 1]<br>blue[:, :, 2] = image[:, :, 2]<br><br>figure, axis = plt.subplots(1, 3)<br>axis[0].imshow(red.astype(int))<br>axis[1].imshow(green.astype(int))<br>axis[2].imshow(blue.astype(int))<br>plt.tight_layout()<br>plt.show()</code>",
        "{13}",
        "Then, as before, we rearrange the pixels into an appropriate input representation for the neural network. There are 24 rows and 19 columns, so there are a total of 456 pixels. Each pixel is typically considered as an individual feature; hence, we have a 456-dimensional vector that represents the image (\\(\\times 3\\) due to the number of colour channels). Here, there are various ways in which the image could be represented, some of which are presented below. The first is a grayscale representation (with the numerical array included, where each pixel value has been normalised, i.e., divided by 255 to obtain values which sit between 0 and 1); the second is an array where the three colour channels have been concatenated into a single vector; and in the third example each colour channel is represented as an individual vector.",
        "<code>\"\"\"Graph flattened grayscale\"\"\"<br><br>gray_image = np.array(ImageOps.grayscale(Image.open(\"mosaic.png\")))<br><br>flat_gray = np.zeros((30, 456))<br><br>flat_gray[:, :] = gray_image.T.flatten()  # flatten by column</code>",
        "{14}",
        "<code>\"\"\"Graph flattened RGB\"\"\"<br><br>red = np.reshape(image.T[0], -1)<br>green = np.reshape(image.T[1], -1)<br>blue = np.reshape(image.T[2], -1)<br><br>red = np.expand_dims(red, -1)<br>green = np.expand_dims(green, -1)<br>blue = np.expand_dims(blue, -1)<br><br>flat = np.zeros((30, 1368, 3))<br><br>flat[:, 0:456, 0] = red<br>flat[:, 456:912, 1] = green<br>flat[:, 912:1368, 2] = blue</code>",
        "{15}",
        "<code>\"\"\"Graph flattened (split) RGB\"\"\"<br><br><flat_R = np.zeros((10, 456, 3))<br>flat_G = np.zeros((10, 456, 3))<br>flat_B = np.zeros((10, 456, 3))<br><br>flat_R[:, :, 0] = red<br>flat_G[:, :, 1] = green<br>flat_B[:, :, 2] = blue</code>",
        "{16}",
        "Representing visual phenomena in this way is surprisingly common and intuitive, even outside the realm of machine learning. During my MA studies, we had some workshops on colour, and one of my designer friends, [16], thought that it would be interesting to represent the colours schemes of motion picture films in a similar way -- by extracting frames at a constant rate and presenting these along a timeline. I believe that she was interested in capturing the change over time (temporal relationships); whereas in ML (static) vision models, time is less relevant, and instead the spatial relationships are generally those which are of interest (to recognise objects in images). However, using representations like those introduced above are actually very inefficient and computationally expensive. This is because we need a fully connected neural network to process each pixel as an individual feature. The most widely used architecture in vision models is the convolutional neural net, where images are typically represented as tensors of shape (<i>image_height</i>, <i>image_width</i>, <i>colour_channels</i>). The features are learned using 2-D feature maps, and the data are not flattened until the final layer(s), where classification takes place.",
        "Representations of natural language function similarly in the way that we wish to learn features which distinguish objects and classes from one another, but the representations used are different. Admittedly, I don’t know much about NLP but have been trying to learn more about it recently. In short, natural language data are tokenised in some way -- e.g., this might involve word vectors or paragraph vectors in the spirit of the <i>bag-of-words</i> representation. A common way to do this is by using <i>n-grams</i>, where data are represented as counts of unique words or unique combinations of words. Each of these is considered to be a feature.",
        "To illustrate this process, consider the first paragraph of Kafka’s <i>Metamorphosis</i>. Here, we tokenise the paragraph by unigrams (single words as opposed to combinations), removing all English stop words (a, and, but, how -- i.e., words with little statistical significance).",
        "<code>from sklearn.feature_extraction.text import CountVectorizer<br><br>data = [\"One morning, when Gregor Samsa woke from troubled dreams, he found himself transformed in his bed into a horrible vermin. He lay on his armour-like back, and if he lifted his head a little he could see his brown belly, slightly domed and divided by arches into stiff sections. The bedding was hardly able to cover it and seemed ready to slide off any moment. His many legs, pitifully thin compared with the size of the rest of him, waved about helplessly as he looked.\"]<br><br>vectoriser = CountVectorizer\\<br><span class='indent'>(min_df=1,</span><br><span class='indent'>stop_words=\"english\",</span><br><span class='indent'>strip_accents=\"unicode\",</span><br><span class='indent'>lowercase=True,</span><br><span class='indent'>ngram_range=(1, 1))</span><br><br>X = vectoriser.fit_transform(data)<br><br>map = {}<br>for i in range(len(vectoriser.get_feature_names())):<br><span class='indent'>map[vectoriser.get_feature_names()[i]] = X.toarray()[0][i]</span><br><br>print(map)</code>",
        "<code>{'able': 1, 'arches': 1, 'armour': 1, 'bed': 1, 'bedding': 1, 'belly': 1, 'brown': 1, 'compared': 1, 'cover': 1, 'divided': 1, 'domed': 1, 'dreams': 1, 'gregor': 1, 'hardly': 1, 'head': 1, 'helplessly': 1, 'horrible': 1, 'lay': 1, 'legs': 1, 'lifted': 1, 'like': 1, 'little': 1, 'looked': 1, 'moment': 1, 'morning': 1, 'pitifully': 1, 'ready': 1, 'rest': 1, 'samsa': 1, 'sections': 1, 'size': 1, 'slide': 1, 'slightly': 1, 'stiff': 1, 'transformed': 1, 'troubled': 1, 'vermin': 1, 'waved': 1, 'woke': 1}</code>",
        "Here, the output is 39 unigrams, and for clarity I’ve mapped the feature labels (words) to their respective counts. Then, we might use something like the <i>term frequency -- inverse document frequency </i> algorithm, where we produce scores to distinguish between meaningful features and less relevant features (in each document). Various (dis)similarity measures can be used to classify the data (e.g., Euclidean distance or cosine similarity) -- these are arbitrary measures which are supposed to be informative of some aspect of the data. (If you’re interested, I’ve tried to outline the technical details of TF*IDF as part of [17] from earlier this year.) Furthermore, modern NLP systems include components such as long short-term memory, attention mechanisms, and so on. And bear in mind, that the example presented here is extremely simplified -- real-world state-of-the-art natural language models contain billions of parameters. No wonder that emergent behaviours might be hard to understand, as the networks are enormous!",
        "So far, we have considered image data and natural language data. We might also wish to represent sound. In terms of ML research, this area does not seem to be as ripe as the previous two; but it is extremely interesting, nevertheless. Audio is sequential, where often temporal relationships are of interest: modelling changes in frequency and amplitude over time. One major issue in modelling raw audio stems from the way in which autoregressive models work, in that predicted (/new) samples are influenced by all previous samples -- and we typically represent sound digitally using a whopping sample rate of 44.1 kHz, i.e., 44100 samples per second. The implication here is that the task of generating new samples is computationally expensive (and thus very slow). However, from previous experience, most sound-related datasets seem to be recorded at 16 kHz, which trades off audio quality for making things slightly easier.",
        "Below is an example of MIDI -- a representation of pitch (/frequency) and velocity over time, using a range of possible values of 0-127. (We return to the Finnish lullaby introduced at the end of the first section -- the melody here is in the F minor key.)",
        "{17}",
        "More specifically, the representation here is known as the <i>piano roll</i>. Pitches follow the vertical axis (increasing as we move up) and time is represented on the horizontal axis (usually relative to the set tempo of the track instead of metric time directly). It is a fairly simple and lightweight representation as it does not include any information regarding timbre or space. It is typically used to program synthesised sound.",
        "In comparison, here are two alternative representations of the same lullaby, where I’ve recorded the melody on a saxophone.",
        "{18}",
        "The higher of the two representations (in green) is known as a <i>waveform</i> representation, which is arguably the most widely recognisable in terms of digital audio. It is a graphical representation of amplitude (on the vertical axis) against time (horizontal axis). Similar to MIDI, it does not reveal much about the characteristics of the sound it represents. It is mostly used to record, sequence and edit raw audio -- to a trained eye it is useful for making qualitative judgements about sound (mostly to do with dynamics and overall levels). The lower representation is a <i>spectral frequency graph</i>, which isn’t as popularised but is extremely informative. It is essentially a waveform representation with an additional feature dimension; that is, the vertical axis represents frequencies (here, ranging from 0 Hz - 42 kH from bottom up -- for reference, the human range of hearing is around 20 Hz - 20 kHz, depending on age and other factors) and amplitude is instead represented by colour.",
        "It is undeniable that the world of data representations is rich and versatile. Here, I’ve only scratched the surface. The area is fertile ground for innovation, in developing new ways of representing the world computationally (NB the paradigm shifting nature of quantum computing). In ML, this interest in representing the world extends to ways in which the representations may be learned. In addition to data representations, there are objective functions (some formal way of representing the problem) and optimisation method (i.e., the process of updating states). Furthermore, there are also things like <i>priors</i>, which represent our beliefs of the world in the form of probability distributions (or more implicitly, this might materialise as a specific choice of architecture where the model favours a certain type of data or emphasises specific types of features), and heaps of other variables to consider.",
        "More generally, computer science research could be characterised as the manipulation of arbitrary representations using mathematical operations. Therefore, representations sit at the very core of the tools which we use to interface with the world around us (and as such, form a crucial part of all scientific research and knowledge).",
        "5. SOME LAST WORDS",
        "This marks the end of the first post in the <i>Cartesian Doubt</i> series. Summa summarum, representations are weird and they’re everywhere. I leave you with the full title of [18]’s play: \"Is it really ever really really really real? Or is real reality really just a representation? Really.\""
      ],
      "links": [
        {
          "Kate Owens": "https://twitter.com/katemath"
        },
        {
          "a series of lectures": "https://youtu.be/uo1xDbsYAcU"
        },
        {
          "Linnea": "https://linnealangfjordkristensen.com/"
        },
        {
          "Salomé Voegelin": "https://soundwords.tumblr.com/"
        },
        {
          "Melanie Mitchell": "https://melaniemitchell.me/aibook/"
        },
        {
          "Douglas Hofstadter": "https://en.wikipedia.org/wiki/Gödel,_Escher,_Bach"
        },
        {
          "Distill": "https://distill.pub/"
        },
        {
          "Michael I. Jordan": "https://www.cs.berkeley.edu/~jordan"
        },
        {
          "Floridi": "https://fivebooks.com/best-books/luciano-floridi-philosophy-information/"
        },
        {
          "Algalon the Observer": "https://wowpedia.fandom.com/wiki/Algalon_the_Observer"
        },
        {
          "Hamkins (2021)": "http://jdh.hamkins.org/lectures-on-the-philosophy-of-mathematics/"
        },
        {
          "Hamkins (<i>ibid.</i>)": "http://jdh.hamkins.org/lectures-on-the-philosophy-of-mathematics/"
        },
        {
          "ImageNet": "https://www.image-net.org/"
        },
        {
          "this example": "https://distill.pub/2020/circuits/curve-circuits/"
        },
        {
          "Lucid": "https://github.com/tensorflow/lucid"
        },
        {
          "Akvile": "https://akvilete.cargo.site/"
        },
        {
          "a small project of mine": "http://34.121.78.114/"
        },
        {
          "Linnea": "https://linnealangfjordkristensen.com/"
        }
      ],
      "media": [
        {
          "Algalon the Observer": "./media/files/algalon.png"
        },
        {
          "The normal distribution": "./media/files/normal.png"
        },
        {
          "Waiting times between tsunamis": "./media/files/tsunamis.png"
        },
        {
          "Sampling distributions": "./media/files/means.png"
        },
        {
          "The settling down phenomenon": "./media/files/settle.png"
        },
        {
          "Virgin Heat Death and Chad Cyclic Universe": "./media/files/virginchaduni.png"
        },
        {
          "Common number sets": "./media/files/numbersets.png"
        },
        {
          "Confused screaming": "./media/files/confusedscream.png"
        },
        {
          "ImageNet elephant": "./media/files/elephant.png"
        },
        {
          "Elephant Lucid visualisation": "./media/files/lucid.png"
        },
        {
          "Grayscale image vector": "./media/files/imageArBW.png"
        },
        {
          "Mosaic RGB": "./media/files/mosaic.png"
        },
        {
          "Mosaic split channel RGB": "./media/files/mosaicRGB.png"
        },
        {
          "Grayscale image vector with numerical array": "./media/files/imageArBWNum.png"
        },
        {
          "RGB image vector": "./media/files/imageArRGB.png"
        },
        {
          "Split channel RGB image vector": "./media/files/imageArRGBSplit.png"
        },
        {
          "MIDI": "./media/files/midi.png"
        },
        {
          "Waveform and Spectral Frequency Graph": "./media/files/waveformspectral.png"
        }
      ]
    },
    {
      "date": "310521",
      "title": "I love my life but sometimes mornings be like",
      "body": [
        "{1}",
        "Source: unknown."
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "Black hole bed": "./media/files/bed.png"
        }
      ]
    },
    {
      "date": "220521",
      "title": "A big time Wonder of the World",
      "body": [
        "[1]. I'm very impressed (and inspired)! It's been insightful to follow his team's problem solving in real-time."
      ],
      "links": [
        {
          "Stephen Wolfram does live CEOing on Twitch": "https://www.twitch.tv/stephen_wolfram"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "120521",
      "title": "Reset day",
      "body": [
        "{1}",
        "Source: unknown.",
        "Pls come carry me to curved (EU-Ravencrest)."
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "Ah shit, here we go again...": "./media/files/wow.png"
        }
      ]
    },
    {
      "date": "110521",
      "title": "The silly kind of FOMO",
      "body": [
        "{1}",
        "Source: unknown.",
        "[1] has me thinking. I love the illustrations on the site (picture unrelated) -- they promote a clear vision: blockchain technology will play a key part in the future of digital transactions, commerce, tokenisation of goods, contracts, and in otherwise serving the global ICT infra.",
        "Assuming this to be true, <i>how long will it take for the vision of materialise?</i> Here, I felt a somewhat familiar, melancholy-inducing FOMO creep into my mind, that I experience regularly about things I have missed or presumably am going to miss in my lifetime -- typically, about life on Earth pre-telecommunications or in the distant future beyond our planet/species. Silly, I realise, but what can you do about the lure of the unknown?",
        "Full disclosure: I've never identified as a futurist-kind of guy (though yes, I enjoy reading Asimov and Ballard). Yea to the wonderful complexity of our natural world, Nay to excessive techno-optimism, I say. But sometimes my imagination gets the better of me and I find myself in a different place, at a different time.",
        "Despite my scepticism, I think it's reasonable to assume that the Mantle of Intelligence could be passed on at some point. [2], in one of his interviews, made a poignant comment: humans are obviously not peak intelligence in terms of what the physical laws of the universe afford (after all, we have evolved under certain environmental and biological pressures).",
        "Reading between the lines of many online blogs, news articles, etc., I sense similar FOMO looming in the air, and so I'm faced with an interesting question: is this something that each generation experiences with respect to their spirit of time?",
        "The irony here is that it is hard to assess the gravity of singular events in real time, as we generally make sense of phenomena in retrospect: contextualising things through experience. By this I mean that life is at best prosaic (in the grand scheme of things). Social change unfolds slowly, and even if we were hypothetically in the midst of a super-intelligent AGI takeover, I doubt that we would realise for a very long time, if ever. A pity, in my curious mind!",
        "Maybe my thought process here is a little bit superficial. After all, there are material issues to be solved presently, and much awesomeness to keep my head beneath the clouds."
      ],
      "links": [
        {
          "ethereum.org": "https://ethereum.org"
        },
        {
          "Scott Aaronson": "https://www.scottaaronson.com/blog/"
        }

      ],
      "media": [
        {
          "FOMO": "./media/files/fomo.png"
        }
      ]
    },
    {
      "date": "240421",
      "title": "☹ ☹ ☹",
      "body": [
        "{1}",
        "Source: unknown."
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "Bacteria Meme": "./media/files/bacteria.jpg"
        }
      ]
    },
    {
      "date": "230421",
      "title": "NLP learning",
      "body": [
        "Today I cleaned up [1] that I was working on earlier this year. Clustering academic research using TF*IDF, PCA and t-SNE."
      ],
      "links": [
        {
          "a small project": "http://34.121.78.114/"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "070421",
      "title": "Imaginary friends",
      "body": [
        "[1] is what most education should be like. P.S. Happy Spring, everyone!"
      ],
      "links": [
        {
          "This": "https://youtu.be/CC5-nQGhz_c"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "270321",
      "title": "Lonely City",
      "body": [
        "Click [1] if you have 15 mins to spare. (Disclaimer: possible SE London bias.)"
      ],
      "links": [
        {
          "here": "https://youtu.be/F4TWpfOs_iA"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "260321",
      "title": "Conversations in VR",
      "body": [
        "Stumbled across [1]. There is something ineffably awesome about online social spaces (forums, MMOs, otherwise obscure corners of the internet), where humans form communities and share stories. Personally, I feel empowered by the anonymity and ephemerality of identity they afford (I think a big part of this is to do with avoiding cognitive bias related to IRL status). Stylistically, this channel is very [2], like it or not..."
      ],
      "links": [
        {
          "Syrmor": "https://www.youtube.com/channel/UCV8Qe8z3RDLiAV7E0WP7-Fg"
        },
        {
          "HONY": "https://www.facebook.com/humansofnewyork"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "121220",
      "title": "A Dog's Dream",
      "body": [
        "A binaural story about insomnia and isolation. Featured as part of YOU, Resonance Extra & YouTube, 12th December 2020.",
        "<div style='padding:56.25% 0 0 0;position:relative;'><iframe src='https://player.vimeo.com/video/490400695' style='position:absolute;top:0;left:0;width:100%;height:100%;' frameborder='0' allow='autoplay; fullscreen'></iframe></div><script src='https://player.vimeo.com/api/player.js'></script>"
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "161020",
      "title": "About Cloudy Logic",
      "body": [
        "Information on my recent project [1]. (EDIT: artwork offline as of July 2021; information about the project archived on the [2] site.)"
      ],
      "links": [
        {
          "Cloudy Logic": "https://cloudylogic.space/about"
        },
        {
          "RCA2020": "https://2020.rca.ac.uk/students/erik-lintunen"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "071020",
      "title": "Wait, what?",
      "body": [
        "{1}",
        "Source: unknown."
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "Loveable Meme": "./media/files/loveable.jpg"
        }
      ]
    },
    {
      "date": "021020",
      "title": "Zeitgeist",
      "body": [
        "{1}",
        "Source: unknown."
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "Deep Learning Meme": "./media/files/gpu.jpg"
        }
      ]
    },
    {
      "date": "230720",
      "title": "RCA2020",
      "body": [
        "[1] is now online as part of [2]. I'm honoured to have my project featured in two guest-curated collections: [3] and [4]. Also visit our own show site [5].",
        "(EDIT: artwork offline as of July 2021. Please leave a message if you'd like access to the work.)"
      ],
      "links": [
        {
          "Cloudy Logic: A Visual Manifesto on Bias": "https://cloudylogic.space/"
        },
        {
          "RCA2020": "https://2020.rca.ac.uk/students/erik-lintunen"
        },
        {
          "Data and AI": "https://2020.rca.ac.uk/collections/data-and-ai"
        },
        {
          "Humanistic Technologists Design For The Now": "https://2020.rca.ac.uk/collections/humanistic-technologists-design-for-the-now"
        },
        {
          "IED2020 site": "https://rcaied.com/"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "070520",
      "title": "Suspensions (Hanging Out and Hanging In)",
      "body": [
        "My work is included in [1] written by [2]."
      ],
      "links": [
        {
          "this article": "https://www.clotmag.com/oped/suspensions-hanging-out-and-hanging-in-suspended-by-covid-19-by-agata-kik"
        },
        {
          "Agata Kik": "https://www.instagram.com/agatakik/"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "060520",
      "title": "Dance dance dance",
      "body": [
        "BAM. Something woke me up in the early hours of the morning. I was confused. There was no better word to describe my mental state at the time. My chest felt tight; brain fatigued and overworked. I could see no light through the sheers; but frankly, in any case was I in no form to produce coherent thoughts about time, having been summoned prematurely from the depths of my unconscious mind.",
        "I sat up on the edge of my futon bed. The floor beneath my feet felt solid, and from what first seemed like an innocent pinch of chill on my toes emerged an overwhelming wave of cold, that traversed vertically through my body -- ruthlessly straightening my spine.",
        "The first notable thing to occupy my mind was the downpour of rain, gently brushing the ceiling above me. The sound was arrhythmic, but soft and pleasant and something that I was lost to, simply listening, for a good while. The comfort was short-lived: in reality, I was losing out on a significant chunk of shuteye (as in the night before, and the night before that, as well as the countless nights recently passed). I knew deep down that it was risky business to leverage my energy reserves; I was knees-deep in water, fully aware of the rising surface, wanting to cut my losses, but lost in the tide.",
        "By now, my legs were borderline numb, and my body fully awake. The coldness was no longer an imposition. There was little point in further resisting the unpleasantness of the bare stone tiles and, in a rather militant manner, my body actualised. Soon thereafter, as my mind caught up, I found myself approaching the kitchen.",
        "My mornings had a ritualistic aspect to them, though I wasn't sure if they actually qualified as rituals per se. Sure, there was a repetitive framework within which everything occurred: coffee, radio and some reads. However, the events lacked consistency (in how they were ordered); and I could effortlessly lose myself to any of these activities for extensive periods of time. But everything happened semi-consciously: my mind was relatively free to venture elsewhere, as my body performed familiar sets of actions, day-in-day-out. Distinctly, the mornings were blessed by clarity, whereas noon was unreasonably costly for my attention span.",
        "I listened to the ambient symphony, now augmented by a flood of coffee dripping into the glass pan. My nose caught onto the familiar scent, that filled the room. I drifted off but was soon grounded by the bleak realisation that it was yet another Monday. Meaning that another week had passed; another had begun, and soon it too would be lost to entropy, gradually disintegrating from once-a-clear-memory to messy insignificant fragments floating in time. And to top it all off, I would probably be standing in the same spot, yet again contemplating the cycle.",
        "I observed nothing of interest out in the garden. The absence of life was normal at this time of year, I guessed, but the stillness was eerie, nevertheless. It could also be night-time -- I was still unsure. Time-of-day mattered little, as I would be unable to return to sleep regardless. Due to my insomnia, time had become more elastic and expendable.",
        "I noticed a full moon in the sky, existing in captivating stillness with few stars distributed across the murky cloudscape. Unperturbed, I poured myself coffee. I walked over to the other room and put on a record; I sat down, and drank the coffee..."
        ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "270220",
      "title": "Elusive Deep Learning",
      "body": [
        "Read on [1]."
      ],
      "links": [
        {
          "Medium": "https://medium.com/@erik.lintunen/elusive-deep-learning-5cd209a1c278?sk=100acfc23af8e5a3adc457b10dbbee59"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "040220",
      "title": "Does a vision materialise when dreamed?",
      "body": [
        "'You're taking away the poetry from my world, man,' I thought, as I listened intently to the passionate gentleman standing before me.",
        "I drew to pass the time (and to distract myself from thinking about you): an abstract city of information; populated by two androgynous figures overlooking the monotonous plane. 'Look around,' they say. 'The patterns are vague here.' And true they were. The horizon was clouded by a vast sea of noise.",
        "All beings and things around me faded, and I sunk deep into my chair held gently against the hard plastic not only by the ever-penetrating force of gravity but also an ineffable energy: I lost myself to thought, losing track of the day, of position, and of all earthly concepts; a fluffy cloud of nothingness surrounded me as I lost all phenomenal presence. I was stripped down and smitten by my memories. WHACK.",
        "The scene played out within the confines of my mind. I was transported some nights back: holding your gaze, somewhat shy, evoking an atmosphere of tension tender but wild. THUMP. Forces collided in time and space; a profoundly unexpected moment and unanticipated feeling, like an ephemeral poem recited by the universe, emerging momentarily amidst the chaos for us to share. 'Yada yada...' my lips were moving to a well-rehearsed story, but my attention was fixed in your stare.",
        "The sonata goes on. The jazz keeps on playing. The moon, perpetually fixed at its piercing exposure, smiling. Does a vision materialise when dreamed?"
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "270120",
      "title": "Learning from Machines",
      "body": [
        "My work is featured in [1] written by [2]."
      ],
      "links": [
        {
          "this article": "https://medium.com/@Kevin7_62820/learning-from-machines-conversations-with-artists-about-machine-learning-7db6b34d038c"
        },
        {
          "Kevin Walker": "http://increasinglyunclear.world"
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "270120",
      "title": "The stars down to Earth",
      "body": [
        "'Adorno was onto something,' I realised, as my shadow wandered through the peculiar scene resembling a familiar tale; perhaps, from the stories of <i>One Thousand and One Nights</i>: a vast desertscape exposed by starlight. Whilst my body lay static on the dune, I was left to navigate the restless labyrinth of my mind.",
        "The view was utterly hypnotising, and I began to draw imaginary connections between each glaring ball of gas in the sky, the light emitting a narrative for the rest of the universe to read: complex histories interwoven; the past and the present compressed into a 2D tapestry, broadcast as a nebulous glow, a heap of meaningless noise.",
        "'I have no knowledge of astronomy,' I murmured to myself, but noticed in the periphery of my eye an uncanny constellation emerging.",
        "I awoke to a sensation of sand dripping down my face; and discovered myself half asleep before a computer screen. A glance outside, through the lonely studio window, was telling of night-time: few apartments displayed any evidence of life in the block facing mine. I prepared myself some coffee, and thereafter devoted my full attention to the task at hand: swiftly, I was swallowed into bit space, and my consciousness descended into a dense philosophical fog.",
        "'Epoch 10,000,' proclaimed the terminal, and so, my algorithmic score had been iterated over and played to its end; and yet another ideology had taken material form. Superficially speaking, the results were impressive, but I was unable to articulate the magic bubbling beneath the surface. I imagined life inside my crystal ball, a somewhat absurd personification of computation: a fantasia of microscopic cogwheels and alien lifeforms tearing down my input images into individual pixels, rearranging these into strings and mechanically transforming the sequences into increasingly intelligible sets of features, the laborious process of prediction overseen by an executive jury. The vision humoured me.",
        "Indeed, the operational aspects of my network were concealed, obfuscated by intricate mathematical operations; therefore, making its internal workings unexplainable. Although I wanted to avoid speculating on its wider implications, the idea of deploying abstract authority into a real-world context felt rather worrying. The performance was otherwordly but indecipherable without a map of some kind: to represent the hierarchy, to read my stars.",
        "I felt the full weight of my insomnia, accentuated by caffeine. It was hard to believe that a fragment of my reality could be captured by the system and, literally, broken into bits. The first observable patterns from my experiments evoked a paralysing sense of awe, a childlike wonder, that I continued to experience long into the gentle winter dawn."
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "160120",
      "title": "B O",
      "body": [
        "<iframe width='100%' height='166' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/745021708%3Fsecret_token%3Ds-DI6Fi&color=%232d352c&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>"
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "310819",
      "title": "Suspensions - 01 東京都",
      "body": [
        "<iframe width='100%' height='166' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/674069354%3Fsecret_token%3Ds-miXej&color=%232d352c&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>"
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    },
    {
      "date": "NA",
      "title": "35mm",
      "body": [
        "{1}",
        "Fujifilm Superia X-TRA 400",
        "{2}",
        "Fujifilm Natura 1600",
        "{3}",
        "Ilford Delta 3200",
        "{4}",
        "{5}",
        "Adox Color Implosion 100",
        "{6}",
        "{7}",
        "{8}",
        "Kodak Portra 800",
        "{9}",
        "{10}",
        "{11}",
        "{12}",
        "{13}",
        "{14}",
        "{15}",
        "{16}",
        "{17}",
        "{18}",
        "Disposables and various"
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "Fujifilm Superia X-TRA 400": "./media/files/superia400-1.png"
        },
        {
          "Fujifilm Natura 1600": "./media/files/natura1600-1.png"
        },
        {
          "Ilford Delta 3200": "./media/files/delta3200-1.png"
        },
        {
          "Adox Color Implosion 100": "./media/files/implosion100-1.png"
        },
        {
          "Adox Color Implosion 100": "./media/files/implosion100-2.png"
        },
        {
          "Kodak Portra 800": "./media/files/portra800-1.png"
        },
        {
          "Kodak Portra 800": "./media/files/portra800-2.png"
        },
        {
          "Kodak Portra 800": "./media/files/portra800-3.png"
        },
        {
          "Tokyo": "./media/files/various-1.png"
        },
        {
          "Tokyo": "./media/files/various-2.png"
        },
        {
          "Tokyo": "./media/files/various-3.png"
        },
        {
          "Various": "./media/files/various-4.png"
        },
        {
          "Various": "./media/files/various-5.png"
        },
        {
          "Various": "./media/files/various-6.png"
        },
        {
          "Various": "./media/files/various-7.png"
        },
        {
          "Various": "./media/files/various-8.png"
        },
        {
          "Various": "./media/files/various-9.png"
        },
        {
          "Various": "./media/files/various-10.png"
        }
      ]
    },
    {
      "date": "NA",
      "title": "Oldies but goldies",
      "body": [
        "<iframe width='100%' height='450' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/1140529015%3Fsecret_token%3Ds-lkpe2eLHjzG&color=%23000000&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>"
      ],
      "links": [
        {
          "": ""
        }
      ],
      "media": [
        {
          "": ""
        }
      ]
    }
  ]



}
